PatternSummary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pattern summary / cheatsheet</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-02 12:21:09 EEST"/>
<meta name="author" content="Ioannis Zannos"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Pattern summary / cheatsheet</h1>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 : Include / incorporate listing from Pattern.html </a></li>
<li><a href="#sec-2">2 Class listing with summaries: </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="todo TODO"> TODO</span> : Include / incorporate listing from Pattern.html </h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Class listing with summaries: </h2>
<div class="outline-text-2" id="text-2">



<p>
Peventmod
Pget
Pswitch
[ Pswitch1 ]
Pevent
Pbinop
Pchain
Pstep3add
Plet
Pstep2add
Pmono
[ PmonoArtic ]
Pif
PstepNfunc
[ PstepNadd ]
Pbeta
</p>
<p>
Pfuncn
Punop
Penvir
Pnaryop
[ PdegreeToKey ]
Pprob
</p>
<p>
PbindProxy
Pkey
Pseries
PhidSlot
PhidKey
Pbrown
[ Pgbrown ]
</p>
<p>
Pcauchy
Ppatmod
Ptime
Prout
[ Proutine Pspawner ]
Pindex
Pbind
[ Posc ]
Pfunc
Ppoisson
Pgeom
Pproto
Phid
Spawner
Pdict
Pstep
[ Pseg ]
</p>

<p>
Pattern Proxies
</p>
<p>
PatternProxy
[
Pdefn
TaskProxy
[
Tdef
EventPatternProxy
[
Pdef
[ Pbindef ]
]
]
]
</p>
<p>
List Patterns
</p>
<p>
ListPattern
[
Pslide
Pxrand
Pfpar
Pwrand
Pshuf
Pseq
[ Pser Place Ppatlace ]
Ptuple
Pwalk
Ppar
[
Pgpar
[ Pgtpar ]
Ptpar
]
Pdfsm
Pfsm
Prand
]
</p>

<p>
Random Generator Patterns
</p>
<p>
Pwhite
[ Phprand Pmeanrand Plprand Pexprand ]
Pgauss
</p>
<p>
Lazy Patterns
</p>
<p>
Plazy
[
PlazyEnvir
[ PlazyEnvirN ]
]
</p>

<p>
Filter Patterns
</p>
<p>
FilterPattern
[
Prorate
Psync
Pwrap
Plambda
Pseed
Psetpre
[ Paddpre Pmulpre ]
PfadeIn
[ PfadeOut ]
Pset
[
Padd
Psetp
[ Paddp Pmulp ]
Pmul
]
Pgroup
Pplayer
Pavaroh
FuncFilterPattern
[ Pwhile Pfset Preject Pcollect Pselect ]
Pstretch
[ Pstretchp ]
Pfin
[ Pfinval ]
Pstutter
[ PdurStutter ]
Pdrop
Pclutch
Pn
PfinQuant
Pfindur
Plag
Psend
Psym
[
Psym1
Pnsym
[ Pnsym1 ]
Ptsym
]
Ptrace
Prewrite
Pbus
Pspawn
Pfx
[ Pfxb ]
Pflow
Pconst
Pprotect
Pbindf
Pclump
[ Pflatten ]
Pdiff
]
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Ioannis Zannos
</p>
<p class="date"> Date: 2011-06-02 12:21:09 EEST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
